emacs-configuration.org
#+TITLE: ivvil's emacs config

* Introduction
This configuration file contains setup of Emacs packages for Language Server Protocol (LSP). I will use ~use-package~ for package management.
* Setup
Since this is an org file, I am using ~org-babel-load-file~ command to load this file from [[init.el]] file. Emacs loads [[init.el]] when it starts. I have setup a variable called ~EMACS_DIR~ to point to *.emacs.d* as the setup directory. Adjust it to match your system. To speed up loading time of emacs, I have used ~gc-cons-threshold~ and ~gc-cons-percentage~ variables, before and after loading this configuration file. I have set ~gc-cons-threshold~ value to 300 mb after startup. Adjust it to comfortable value according to memory in your system. ~lsp-java~ package however has ~1GB~ setup as default.
  
** Setup repository in org file
In the following code block, we will initialize package repositories and after that install ~use-package~. This package is used to install other packages.

#+BEGIN_SRC emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
						   ("elpa" . "https://elpa.gnu.org/packages/")
						   ("org" . "https://orgmode.org/elpa/")
						   ("nongnu" . "https://elpa.nongnu.org/nongnu/")
						   ))

  (package-initialize)
										  ; Fetch the list of packages available 
  (unless package-archive-contents (package-refresh-contents))

										  ; Install use-package
  (setq package-list '(use-package))
  (dolist (package package-list)
	(unless (package-installed-p package) (package-install package)))

#+END_SRC

** Environment Setup
In some operating systems Emacs does not load environment variables properly. Therefore, below we install a package called ~exec-path-from-shell~ and initialize it.

 #+begin_src emacs-lisp
   ;; (use-package exec-path-from-shell :ensure t)
   ;; (exec-path-from-shell-initialize)
 #+end_src

** Operating System specific variable setup
   Since we want to use same emacs configuration for each of our operating systems, we want to separate values that are different between different operating systems. In my setup, I have different values for ~JAVA_HOME~ in my linux.el and mac.el. Adjust these values accordingly for your setup if you are using different versions of Java. Following code loads mac.el, linux.el or windows.el based on where you run this configuration.

#+BEGIN_SRC emacs-lisp
 ;; Load platform specific variables using specific files. E.g. linux.el. 
 ;; Make necessary changes as needed
 (cond ((eq system-type 'windows-nt) (load (concat EMACS_DIR "windows")))
 ((eq system-type 'gnu/linux) (load (concat EMACS_DIR "linux")))
 ((eq system-type 'darwin) (load (concat EMACS_DIR "mac")))
 (t (load-library "default")))
 #+END_SRC

** Basic setup

Here, I add some basic emacs setup like loading the language, disabling the toolbar, setting up backup directory etc. I have added comments to each setting.

#+BEGIN_SRC emacs-lisp
  ;; Disable annoying ring-bell when backspace key is pressed in certain situations
  (setq ring-bell-function 'ignore)

  ;; Disable scrollbar and toolbar
  (scroll-bar-mode -1)
  (tool-bar-mode -1)

  ;; Set language environment to UTF-8
  (set-language-environment "UTF-8")
  (set-default-coding-systems 'utf-8)

  ;; Longer whitespace, otherwise syntax highlighting is limited to default column
  (setq whitespace-line-column 1000) 

  ;; Enable soft-wrap
  (global-visual-line-mode 1)

  ;; Maintain a list of recent files opened
  (recentf-mode 1)            
  (setq recentf-max-saved-items 50)

  ;; Move all the backup files to specific cache directory
  ;; This way you won't have annoying temporary files starting with ~(tilde) in each directory
  ;; Following setting will move temporary files to specific folders inside cache directory in EMACS_DIR

  (setq user-cache-directory (concat EMACS_DIR "cache"))
  (setq backup-directory-alist `(("." . ,(expand-file-name "backups" user-cache-directory)))
		url-history-file (expand-file-name "url/history" user-cache-directory)
		auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-" user-cache-directory)
		projectile-known-projects-file (expand-file-name "projectile-bookmarks.eld" user-cache-directory))

  ;; Org-mode issue with src block not expanding
  ;; This is a fix for bug in org-mode where <s TAB does not expand SRC block
  (when (version<= "9.2" (org-version))
	(require 'org-tempo))

  ;; Coding specific setting

  ;; Automatically add ending brackets and braces
  (electric-pair-mode 1)

  ;; Make sure tab-width is 4 and not 8
  (setq-default tab-width 4)

  ;; Highlight matching brackets and braces
  (show-paren-mode 1)

  ;; Disable default startup buffer
  (setq inhibit-startup-screen t)

  ;; Enable disabled comands
  (setq disabled-command-function nil)

  ;; Add other elisp files to ~load-path~
  (defun add-subdirectories-to-load-path (directory)
	"Add subdirectories of DIRECTORY to the `load-path`."
	(interactive "Directory: ")
	(let ((default-directory (file-name-as-directory directory)))
	  (dolist (subdir (directory-files directory t "^[^.]" 'nosort))
		(when (file-directory-p subdir)
		  (add-to-list 'load-path subdir)))))

  (add-subdirectories-to-load-path "~/.emacs.d/elisp")

  ;; Highlight todos
  (use-package hl-todo
	:ensure t
	:init (global-hl-todo-mode))
#+END_SRC

** Emacs dashboard

#+begin_src emacs-lisp
  ;; use-package with package.el:
  (use-package dashboard
	:ensure t
	:config
	(dashboard-setup-startup-hook)
	(setq dashboard-projects-backend 'projectile))
  (setq dashboard-display-icons-p t) ;; display icons on both GUI and terminal
  ;; (setq dashboard-icon-type 'nerd-icons) ;; use `nerd-icons' package
  (setq dashboard-icon-type 'all-the-icons) ;; use `all-the-icons' package
  ;; (setq dashboard-set-heading-icons t)
  ;; (setq dashboard-set-file-icons t)

  (setq dashboard-startup-banner 'logo)
  ;; Value can be
  ;; - nil to display no banner
  ;; - 'official which displays the official emacs logo
  ;; - 'logo which displays an alternative emacs logo
  ;; - 1, 2 or 3 which displays one of the text banners
  ;; - "path/to/your/image.gif", "path/to/your/image.png", "path/to/your/text.txt" or "path/to/your/image.xbm" which displays whatever gif/image/text/xbm you would prefer
  ;; - a cons of '("path/to/your/image.png" . "path/to/your/text.txt")

  (setq dashboard-items '((recents  . 5)
						  (bookmarks . 5)
						  (projects . 5)
						  (agenda . 5)
						  (registers . 5)))

  (setq dashboard-startupify-list '(dashboard-insert-banner
									dashboard-insert-newline
									dashboard-insert-banner-title
									dashboard-insert-newline
									dashboard-insert-navigator
									dashboard-insert-newline
									dashboard-insert-init-info
									dashboard-insert-items
									dashboard-insert-newline
									dashboard-insert-footer))
#+end_src

*** Page break lines

#+begin_src emacs-lisp
  (use-package page-break-lines :ensure t)
#+end_src

*** All the icons

#+begin_src emacs-lisp
  (use-package all-the-icons
	:if (display-graphic-p) :ensure t)
  (use-package all-the-icons-dired :ensure t)
  (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
#+end_src

*** Nerd icons

#+begin_src emacs-lisp
  ;; (use-package nerd-icons
  ;;   ;; :custom
  ;;   ;; The Nerd Font you want to use in GUI
  ;;   ;; "Symbols Nerd Font Mono" is the default and is recommended
  ;;   ;; but you can use any other Nerd Font if you want
  ;;   ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
  ;;   :ensure t
  ;;   )
#+end_src



** Other packages for the config

#+begin_src emacs-lisp
  ;; (use-package s
  ;;   :ensure t)
  ;; (require 'which-linux-distribution)
#+end_src

* Looks

** Font

#+begin_src emacs-lisp 
(set-face-attribute 'default nil :font "CaskaydiaCove Nerd Font-10")
(set-frame-font "CaskaydiaCove Nerd Font-10" nil t)
#+end_src

** Theme
   I tend to like *doom-themes* package. Below we will install doom theme. In addition, I will also install a package called *heaven-and-hell*. This allows us to toggle between two themes using a shortcut key. I will assign ~F6~ key to toggling the theme and ~C-c F6~ to set to default theme.

#+BEGIN_SRC emacs-lisp
  (use-package doom-themes
	:ensure t 
	:init 
	(load-theme 'doom-palenight t))

  (use-package solo-jazz-theme
	:ensure t)

  (use-package heaven-and-hell
	:ensure t
	:init
	(setq heaven-and-hell-theme-type 'dark)
	(setq heaven-and-hell-themes
		  '((light . doom-solarized-light)
			(dark . doom-solarized-dark-high-contrast)))
	:hook (after-init . heaven-and-hell-init-hook)
	:bind (("C-c <f6>" . heaven-and-hell-load-default-theme)
		   ("<f6>" . heaven-and-hell-toggle-theme)))

#+END_SRC

If you press F6 key in your keyboard, it should switch between doom-palenight and doom-acario-light themes. If you want to go back to the default theme press ~Ctrl + C and F6~.

** Disable ansi color in compilation mode
   This will help eliminate weird escape sequences during compilation of projects.
   #+begin_src emacs-lisp

   (defun my/ansi-colorize-buffer ()
   (let ((buffer-read-only nil))
   (ansi-color-apply-on-region (point-min) (point-max))))
   
   (use-package ansi-color
   :ensure t
   :config
   (add-hook 'compilation-filter-hook 'my/ansi-colorize-buffer)
   )
   #+end_src

