emacs-configuration.el
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
						   ("elpa" . "https://elpa.gnu.org/packages/")
						   ("org" . "https://orgmode.org/elpa/")
						   ("nongnu" . "https://elpa.nongnu.org/nongnu/")
						   ))

(package-initialize)
										  ; Fetch the list of packages available 
(unless package-archive-contents (package-refresh-contents))

										  ; Install use-package
(setq package-list '(use-package))
(dolist (package package-list)
	(unless (package-installed-p package) (package-install package)))

;; (use-package exec-path-from-shell :ensure t)
;; (exec-path-from-shell-initialize)

;; Load platform specific variables using specific files. E.g. linux.el. 
;; Make necessary changes as needed
(cond ((eq system-type 'windows-nt) (load (concat EMACS_DIR "windows")))
((eq system-type 'gnu/linux) (load (concat EMACS_DIR "linux")))
((eq system-type 'darwin) (load (concat EMACS_DIR "mac")))
(t (load-library "default")))

;; Disable annoying ring-bell when backspace key is pressed in certain situations
(setq ring-bell-function 'ignore)

;; Disable scrollbar and toolbar
(scroll-bar-mode -1)
(tool-bar-mode -1)

;; Set language environment to UTF-8
(set-language-environment "UTF-8")
(set-default-coding-systems 'utf-8)

;; Longer whitespace, otherwise syntax highlighting is limited to default column
(setq whitespace-line-column 1000) 

;; Enable soft-wrap
(global-visual-line-mode 1)

;; Maintain a list of recent files opened
(recentf-mode 1)            
(setq recentf-max-saved-items 50)

;; Move all the backup files to specific cache directory
;; This way you won't have annoying temporary files starting with ~(tilde) in each directory
;; Following setting will move temporary files to specific folders inside cache directory in EMACS_DIR

(setq user-cache-directory (concat EMACS_DIR "cache"))
(setq backup-directory-alist `(("." . ,(expand-file-name "backups" user-cache-directory)))
		url-history-file (expand-file-name "url/history" user-cache-directory)
		auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-" user-cache-directory)
		projectile-known-projects-file (expand-file-name "projectile-bookmarks.eld" user-cache-directory))

;; Org-mode issue with src block not expanding
;; This is a fix for bug in org-mode where <s TAB does not expand SRC block
(when (version<= "9.2" (org-version))
	(require 'org-tempo))

;; Coding specific setting

;; Automatically add ending brackets and braces
(electric-pair-mode 1)

;; Make sure tab-width is 4 and not 8
(setq-default tab-width 4)

;; Highlight matching brackets and braces
(show-paren-mode 1)

;; Disable default startup buffer
(setq inhibit-startup-screen t)

;; Enable disabled comands
(setq disabled-command-function nil)

;; Add other elisp files to ~load-path~
(defun add-subdirectories-to-load-path (directory)
	"Add subdirectories of DIRECTORY to the `load-path`."
	(interactive "Directory: ")
	(let ((default-directory (file-name-as-directory directory)))
	  (dolist (subdir (directory-files directory t "^[^.]" 'nosort))
		(when (file-directory-p subdir)
		  (add-to-list 'load-path subdir)))))

(add-subdirectories-to-load-path "~/.emacs.d/elisp")

;; Highlight todos
(use-package hl-todo
	:ensure t
	:init (global-hl-todo-mode))

;; use-package with package.el:
(use-package dashboard
	:ensure t
	:config
	(dashboard-setup-startup-hook)
	(setq dashboard-projects-backend 'projectile))
(setq dashboard-display-icons-p t) ;; display icons on both GUI and terminal
;; (setq dashboard-icon-type 'nerd-icons) ;; use `nerd-icons' package
(setq dashboard-icon-type 'all-the-icons) ;; use `all-the-icons' package
;; (setq dashboard-set-heading-icons t)
;; (setq dashboard-set-file-icons t)

(setq dashboard-startup-banner 'logo)
;; Value can be
;; - nil to display no banner
;; - 'official which displays the official emacs logo
;; - 'logo which displays an alternative emacs logo
;; - 1, 2 or 3 which displays one of the text banners
;; - "path/to/your/image.gif", "path/to/your/image.png", "path/to/your/text.txt" or "path/to/your/image.xbm" which displays whatever gif/image/text/xbm you would prefer
;; - a cons of '("path/to/your/image.png" . "path/to/your/text.txt")

(setq dashboard-items '((recents  . 5)
						  (bookmarks . 5)
						  (projects . 5)
						  (agenda . 5)
						  (registers . 5)))

(setq dashboard-startupify-list '(dashboard-insert-banner
									dashboard-insert-newline
									dashboard-insert-banner-title
									dashboard-insert-newline
									dashboard-insert-navigator
									dashboard-insert-newline
									dashboard-insert-init-info
									dashboard-insert-items
									dashboard-insert-newline
									dashboard-insert-footer))

(use-package page-break-lines :ensure t)

(use-package all-the-icons
	:if (display-graphic-p) :ensure t)
(use-package all-the-icons-dired :ensure t)
(add-hook 'dired-mode-hook 'all-the-icons-dired-mode)

;; (use-package nerd-icons
;;   ;; :custom
;;   ;; The Nerd Font you want to use in GUI
;;   ;; "Symbols Nerd Font Mono" is the default and is recommended
;;   ;; but you can use any other Nerd Font if you want
;;   ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
;;   :ensure t
;;   )

;; (use-package s
;;   :ensure t)
;; (require 'which-linux-distribution)

(set-face-attribute 'default nil :font "CaskaydiaCove Nerd Font-10")
(set-frame-font "CaskaydiaCove Nerd Font-10" nil t)

(use-package doom-themes
	:ensure t 
	:init 
	(load-theme 'doom-palenight t))

(use-package solo-jazz-theme
	:ensure t)

(use-package heaven-and-hell
	:ensure t
	:init
	(setq heaven-and-hell-theme-type 'dark)
	(setq heaven-and-hell-themes
		  '((light . doom-solarized-light)
			(dark . doom-solarized-dark-high-contrast)))
	:hook (after-init . heaven-and-hell-init-hook)
	:bind (("C-c <f6>" . heaven-and-hell-load-default-theme)
		   ("<f6>" . heaven-and-hell-toggle-theme)))

(defun my/ansi-colorize-buffer ()
(let ((buffer-read-only nil))
(ansi-color-apply-on-region (point-min) (point-max))))

(use-package ansi-color
:ensure t
:config
(add-hook 'compilation-filter-hook 'my/ansi-colorize-buffer)
)
