emacs-configuration.org
** Code ligatures

#+begin_src emacs-lisp
  (use-package ligature
    :ensure t
    :config
    ;; Enable the "www" ligature in every possible major mode
    (ligature-set-ligatures 't '("www"))
    ;; Enable traditional ligature support in eww-mode, if the
    ;; `variable-pitch' face supports it
    (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
    ;; Enable all Cascadia and Fira Code ligatures in programming modes
    (ligature-set-ligatures 'prog-mode
  						  '(;; == === ==== => =| =>>=>=|=>==>> ==< =/=//=// =~
  							;; =:= =!=
  							("=" (rx (+ (or ">" "<" "|" "/" "~" ":" "!" "="))))
  							;; ;; ;;;
  							(";" (rx (+ ";")))
  							;; && &&&
  							("&" (rx (+ "&")))
  							;; !! !!! !. !: !!. != !== !~
  							("!" (rx (+ (or "=" "!" "\." ":" "~"))))
  							;; ?? ??? ?:  ?=  ?.
  							("?" (rx (or ":" "=" "\." (+ "?"))))
  							;; %% %%%
  							("%" (rx (+ "%")))
  							;; |> ||> |||> ||||> |] |} || ||| |-> ||-||
  							;; |->>-||-<<-| |- |== ||=||
  							;; |==>>==<<==<=>==//==/=!==:===>
  							("|" (rx (+ (or ">" "<" "|" "/" ":" "!" "}" "\]"
  											"-" "=" ))))
  							;; \\ \\\ \/
  							("\\" (rx (or "/" (+ "\\"))))
  							;; ++ +++ ++++ +>
  							("+" (rx (or ">" (+ "+"))))
  							;; :: ::: :::: :> :< := :// ::=
  							(":" (rx (or ">" "<" "=" "//" ":=" (+ ":"))))
  							;; // /// //// /\ /* /> /===:===!=//===>>==>==/
  							("/" (rx (+ (or ">"  "<" "|" "/" "\\" "\*" ":" "!"
  											"="))))
  							;; .. ... .... .= .- .? ..= ..<
  							("\." (rx (or "=" "-" "\?" "\.=" "\.<" (+ "\."))))
  							;; -- --- ---- -~ -> ->> -| -|->-->>->--<<-|
  							("-" (rx (+ (or ">" "<" "|" "~" "-"))))
  							;; *> */ *)  ** *** ****
  							("*" (rx (or ">" "/" ")" (+ "*"))))
  							;; www wwww
  							("w" (rx (+ "w")))
  							;; <> <!-- <|> <: <~ <~> <~~ <+ <* <$ </  <+> <*>
  							;; <$> </> <|  <||  <||| <|||| <- <-| <-<<-|-> <->>
  							;; <<-> <= <=> <<==<<==>=|=>==/==//=!==:=>
  							;; << <<< <<<<
  							("<" (rx (+ (or "\+" "\*" "\$" "<" ">" ":" "~"  "!"
  											"-"  "/" "|" "="))))
  							;; >: >- >>- >--|-> >>-|-> >= >== >>== >=|=:=>>
  							;; >> >>> >>>>
  							(">" (rx (+ (or ">" "<" "|" "/" ":" "=" "-"))))
  							;; #: #= #! #( #? #[ #{ #_ #_( ## ### #####
  							("#" (rx (or ":" "=" "!" "(" "\?" "\[" "{" "_(" "_"
  										 (+ "#"))))
  							;; ~~ ~~~ ~=  ~-  ~@ ~> ~~>
  							("~" (rx (or ">" "=" "-" "@" "~>" (+ "~"))))
  							;; __ ___ ____ _|_ __|____|_
  							("_" (rx (+ (or "_" "|"))))
  							;; Fira code: 0xFF 0x12
  							;; ("0" (rx (and "x" (+ (in "A-F" "a-f" "0-9")))))
  							;; Fira code:
  							;; "Fl"  "Tl"  "fi"  "fj"  "fl"  "ft"
  							;; The few not covered by the regexps.
  							"{|"  "[|"  "]#"  "(*"  "}#"  "$>"  "^="))
    ;; Enables ligature checks globally in all buffers. You can also do it
    ;; per mode with `ligature-mode'.
    (global-ligature-mode t))
#+end_src

** Doom modeline

#+begin_src emacs-lisp 
  (use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode))
#+end_src

** Rainbow delimiters

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
	:ensure t
	:hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Page break lines

#+begin_src emacs-lisp 
  (use-package page-break-lines
	:ensure t
	:init (global-page-break-lines-mode))
#+end_src

** Solaire

#+begin_src emacs-lisp 
  ;; (use-package solaire-mode
  ;;   :ensure t
  ;;   :init (solaire-global-mode +1))
#+end_src

* Custom Packages
  In this section we will install some of the packages that we will use for various project and file management.

** Key-Chord
   Key-Chord allows us to bind regular keyboard keys for various commands without having to use prefix keys such as Ctrl, Alt or Super etc.

#+begin_src emacs-lisp
  (use-package use-package-chords
	:ensure t
	:init 
	:config (key-chord-mode 1)
	(setq key-chord-two-keys-delay 0.4)
	(setq key-chord-one-key-delay 0.5) ; default 0.2
	)
#+end_src
Here, we changed the delay for the consecutive key to be little higher than default. Adjust this to what you feel comfortable.

** Projectile
   Projectile helps us with easy navigation within a project. Projectile recognizes several source control managed folders e.g *git, mercurial, maven, sbt*, and a folder with empty *.projectile* file. You can use ~C-c p~ to invoke any projectile command. This is a very useful key to remember.

#+begin_src emacs-lisp
(use-package projectile 
:ensure t
:init (projectile-mode +1)
:config 
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
)   
#+end_src

** Helm
Helm allows for easy completion of commands. Below, we will replace several of the built in functions with helm versions and add keyboard shortcuts for couple of new useful commands.

#+BEGIN_SRC emacs-lisp
(use-package helm
:ensure t
:init 
(helm-mode 1)
(progn (setq helm-buffers-fuzzy-matching t))
:bind
(("C-c h" . helm-command-prefix))
(("M-x" . helm-M-x))
(("C-x C-f" . helm-find-files))
(("C-x b" . helm-buffers-list))
(("C-c b" . helm-bookmarks))
(("C-c f" . helm-recentf))   ;; Add new key to recentf
(("C-c g" . helm-grep-do-git-grep)))  ;; Search using grep in a git project
#+END_SRC

I want to point out, couple of interesting things from above setup. Just like we added ~C-c p~ as a prefix for projectile, here we added ~C-c h~ for helm. We also enabled fuzzy matching, so that your search text don't need to be very strict. Also, I added ~C-c g~ to helm-grep-do-git-grep. I can search files with specific text within a git project (make sure to commit it first).

*** Helm Descbinds
Helm descbinds helps to easily search for keyboard shortcuts for modes that are currently active in the project. This can be helpful to discover keyboard shortcuts to various commands. Use ~C-h b~ to bring up helm-descbinds window.

#+begin_src emacs-lisp
(use-package helm-descbinds
:ensure t
:bind ("C-h b" . helm-descbinds))
#+end_src

E.g. In helm-descbinds window you could type "helm" and "projectile" and see all the shortcuts assigned to various commands.

*** Helm swoop
Helm swoop allows to quickly search for text under cursor or new text within current file. I am sure you are already using ~C-s~ and ~C-r~ to search within the file. This package compliments rather than replace it. You can quickly type ~js~ to search and jump to the target line. To go back to where you started searching, use ~jp~. You can use ~M-m~ from ~C-s~ and ~C-r~ search to start using helm-swoop as described in below setting.

#+begin_src emacs-lisp
(use-package helm-swoop 
:ensure t
:chords
("js" . helm-swoop)
("jp" . helm-swoop-back-to-last-point)
:init
(bind-key "M-m" 'helm-swoop-from-isearch isearch-mode-map)

;; If you prefer fuzzy matching
(setq helm-swoop-use-fuzzy-match t)

;; Save buffer when helm-multi-swoop-edit complete
(setq helm-multi-swoop-edit-save t)

;; If this value is t, split window inside the current window
(setq helm-swoop-split-with-multiple-windows nil)

;; Split direction. 'split-window-vertically or 'split-window-horizontally
(setq helm-swoop-split-direction 'split-window-vertically)

;; If nil, you can slightly boost invoke speed in exchange for text color
(setq helm-swoop-speed-or-color nil)

;; ;; Go to the opposite side of line from the end or beginning of line
(setq helm-swoop-move-to-line-cycle t)

)
#+end_src

*** Helm tramp
Helm tramp allows ~TRAMP~ autocompletion. 

#+begin_src emacs-lisp
  (use-package helm-tramp :ensure t)
#+end_src

** Avy Goto
   Avy allows you to quickly jump to certain character, word or line within the file. Use ~jc~, ~jw~ or ~jl~ to quickly jump within current file. Change it to other keys, if you feel you are using this set of keys for other purposes. 

#+begin_src emacs-lisp
(use-package avy 
:ensure t
:chords
("jc" . avy-goto-char)
("jw" . avy-goto-word-1)
("jl" . avy-goto-line))
#+end_src

** Which Key
For some prefix commands like ~C-c p~ or ~C-c h~ we want Emacs to visually guide you through the available options. Following package allows us to do that.
#+begin_src emacs-lisp
(use-package which-key 
:ensure t 
:init
(which-key-mode)
)
#+end_src

** Run Code
We can use quickrun package to execute code (if it has main). E.g. If you have a java file with main method, it will run with the associated shortcut key ~C-c r~ or quickrun command. Quickrun has support for several languages.
#+begin_src emacs-lisp
(use-package quickrun 
:ensure t
:bind ("C-c r" . quickrun))
#+end_src

** Magit
A VC plugin that has github integrations
#+begin_src emacs-lisp
  (use-package magit :ensure t)
  ;; (use-package magit-todos
  ;; 	:ensure t
  ;; 	:after magit
  ;; 	:config (magit-todos-mode 1))
  (setenv "TERM" "dumb")
#+end_src

** Envrc

#+begin_src emacs-lisp
  (use-package envrc :ensure t
	:init (envrc-mode))
#+end_src

** vterm

#+begin_src emacs-lisp
  (use-package vterm :ensure t)
  (use-package eshell-vterm :ensure t)
#+end_src

