emacs-configuration.el

(use-package ligature
	:ensure t
	:config
	;; Enable the "www" ligature in every possible major mode
	(ligature-set-ligatures 't '("www"))
	;; Enable traditional ligature support in eww-mode, if the
	;; `variable-pitch' face supports it
	(ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
	;; Enable all Cascadia and Fira Code ligatures in programming modes
	(ligature-set-ligatures 'prog-mode
							'(;; == === ==== => =| =>>=>=|=>==>> ==< =/=//=// =~
							  ;; =:= =!=
							  ("=" (rx (+ (or ">" "<" "|" "/" "~" ":" "!" "="))))
							  ;; ;; ;;;
							  (";" (rx (+ ";")))
							  ;; && &&&
							  ("&" (rx (+ "&")))
							  ;; !! !!! !. !: !!. != !== !~
							  ("!" (rx (+ (or "=" "!" "\." ":" "~"))))
							  ;; ?? ??? ?:  ?=  ?.
							  ("?" (rx (or ":" "=" "\." (+ "?"))))
							  ;; %% %%%
							  ("%" (rx (+ "%")))
							  ;; |> ||> |||> ||||> |] |} || ||| |-> ||-||
							  ;; |->>-||-<<-| |- |== ||=||
							  ;; |==>>==<<==<=>==//==/=!==:===>
							  ("|" (rx (+ (or ">" "<" "|" "/" ":" "!" "}" "\]"
											  "-" "=" ))))
							  ;; \\ \\\ \/
							  ("\\" (rx (or "/" (+ "\\"))))
							  ;; ++ +++ ++++ +>
							  ("+" (rx (or ">" (+ "+"))))
							  ;; :: ::: :::: :> :< := :// ::=
							  (":" (rx (or ">" "<" "=" "//" ":=" (+ ":"))))
							  ;; // /// //// /\ /* /> /===:===!=//===>>==>==/
							  ("/" (rx (+ (or ">"  "<" "|" "/" "\\" "\*" ":" "!"
											  "="))))
							  ;; .. ... .... .= .- .? ..= ..<
							  ("\." (rx (or "=" "-" "\?" "\.=" "\.<" (+ "\."))))
							  ;; -- --- ---- -~ -> ->> -| -|->-->>->--<<-|
							  ("-" (rx (+ (or ">" "<" "|" "~" "-"))))
							  ;; *> */ *)  ** *** ****
							  ("*" (rx (or ">" "/" ")" (+ "*"))))
							  ;; www wwww
							  ("w" (rx (+ "w")))
							  ;; <> <!-- <|> <: <~ <~> <~~ <+ <* <$ </  <+> <*>
							  ;; <$> </> <|  <||  <||| <|||| <- <-| <-<<-|-> <->>
							  ;; <<-> <= <=> <<==<<==>=|=>==/==//=!==:=>
							  ;; << <<< <<<<
							  ("<" (rx (+ (or "\+" "\*" "\$" "<" ">" ":" "~"  "!"
											  "-"  "/" "|" "="))))
							  ;; >: >- >>- >--|-> >>-|-> >= >== >>== >=|=:=>>
							  ;; >> >>> >>>>
							  (">" (rx (+ (or ">" "<" "|" "/" ":" "=" "-"))))
							  ;; #: #= #! #( #? #[ #{ #_ #_( ## ### #####
							  ("#" (rx (or ":" "=" "!" "(" "\?" "\[" "{" "_(" "_"
										   (+ "#"))))
							  ;; ~~ ~~~ ~=  ~-  ~@ ~> ~~>
							  ("~" (rx (or ">" "=" "-" "@" "~>" (+ "~"))))
							  ;; __ ___ ____ _|_ __|____|_
							  ("_" (rx (+ (or "_" "|"))))
							  ;; Fira code: 0xFF 0x12
							  ;; ("0" (rx (and "x" (+ (in "A-F" "a-f" "0-9")))))
							  ;; Fira code:
							  ;; "Fl"  "Tl"  "fi"  "fj"  "fl"  "ft"
							  ;; The few not covered by the regexps.
							  "{|"  "[|"  "]#"  "(*"  "}#"  "$>"  "^="))
	;; Enables ligature checks globally in all buffers. You can also do it
	;; per mode with `ligature-mode'.
	(global-ligature-mode t))

(use-package doom-modeline
:ensure t
:init (doom-modeline-mode))

(use-package rainbow-delimiters
	:ensure t
	:hook (prog-mode . rainbow-delimiters-mode))

(use-package page-break-lines
	:ensure t
	:init (global-page-break-lines-mode))

;; (use-package solaire-mode
;;   :ensure t
;;   :init (solaire-global-mode +1))

(use-package use-package-chords
	:ensure t
	:init 
	:config (key-chord-mode 1)
	(setq key-chord-two-keys-delay 0.4)
	(setq key-chord-one-key-delay 0.5) ; default 0.2
	)

(use-package projectile 
:ensure t
:init (projectile-mode +1)
:config 
(define-key projectile-mode-map (kbd "C-c p") 'projectile-command-map)
)

(use-package helm
:ensure t
:init 
(helm-mode 1)
(progn (setq helm-buffers-fuzzy-matching t))
:bind
(("C-c h" . helm-command-prefix))
(("M-x" . helm-M-x))
(("C-x C-f" . helm-find-files))
(("C-x b" . helm-buffers-list))
(("C-c b" . helm-bookmarks))
(("C-c f" . helm-recentf))   ;; Add new key to recentf
(("C-c g" . helm-grep-do-git-grep)))  ;; Search using grep in a git project

(use-package helm-descbinds
:ensure t
:bind ("C-h b" . helm-descbinds))

(use-package helm-swoop 
:ensure t
:chords
("js" . helm-swoop)
("jp" . helm-swoop-back-to-last-point)
:init
(bind-key "M-m" 'helm-swoop-from-isearch isearch-mode-map)

;; If you prefer fuzzy matching
(setq helm-swoop-use-fuzzy-match t)

;; Save buffer when helm-multi-swoop-edit complete
(setq helm-multi-swoop-edit-save t)

;; If this value is t, split window inside the current window
(setq helm-swoop-split-with-multiple-windows nil)

;; Split direction. 'split-window-vertically or 'split-window-horizontally
(setq helm-swoop-split-direction 'split-window-vertically)

;; If nil, you can slightly boost invoke speed in exchange for text color
(setq helm-swoop-speed-or-color nil)

;; ;; Go to the opposite side of line from the end or beginning of line
(setq helm-swoop-move-to-line-cycle t)

)

(use-package helm-tramp :ensure t)

(use-package avy 
:ensure t
:chords
("jc" . avy-goto-char)
("jw" . avy-goto-word-1)
("jl" . avy-goto-line))

(use-package which-key 
:ensure t 
:init
(which-key-mode)
)

(use-package quickrun 
:ensure t
:bind ("C-c r" . quickrun))

(use-package magit :ensure t)
;; (use-package magit-todos
;; 	:ensure t
;; 	:after magit
;; 	:config (magit-todos-mode 1))
(setenv "TERM" "dumb")

(use-package envrc :ensure t
	:init (envrc-mode))

(use-package vterm :ensure t)
(use-package eshell-vterm :ensure t)
