emacs-configuration.org
** EMMS

#+begin_src emacs-lisp
  ;; (use-package emms
  ;;   :config
  ;;   (require 'emms-player-mpd)
  ;;   (require 'emms-mpris)
  ;;   (emms-all)
  ;;   (setq emms-player-list emms-player-mpd)
  ;;   (setq emms-info-functions 'emms-info-mpd)
  ;;   (setq emms-change-volume-function 'emms-volume-mpd-change)
  ;;   (fset emms-browser-covers 'emms-browser-cache-thumbnail)
  ;;   (add-to-list 'emms-player-list 'emms-player-mpd))

  ;; (emms-all)
  ;; (emms-default-players)
  ;; (emms-mode-line 1)

  ;; (use-package emms-browser
  ;;   :config
  ;;   (setq emms-browser-covers 'emms-browser-cache-thumbnail)
  ;;   (setq emms-browser-covers-for-first-column 'emms-browser-cache-thumbnail))

  ;; (use-package emms-player-mpd
  ;;   :config
  ;;   (setq emms-player-list '(emms-player-mpd))
  ;;   (setq emms-info-functions '(emms-info-mpd))
  ;;   (setq emms-change-volume-function 'emms-volume-mpd-change)
  ;;   (add-to-list 'emms-player-list 'emms-player-mpd))

#+end_src

** Elcord

#+begin_src emacs-lisp
  (use-package elcord :ensure t)
  (elcord-mode)
#+end_src

** Bitlbee

#+begin_src emacs-lisp
  ;; (when (s-contains? "NixOS" (which-linux-distribution)) (fset 'bitlbee-command-line
  ;; 							     (lambda ()
  ;; 							   ((concat bitlbee-executable " " bitlbee-options " -d " bitlbee-user-directory)))))
  ;; (use-package bitlbee :ensure t)
#+end_src

** Undo history

#+begin_src emacs-lisp
  (use-package undo-tree :ensure t :init (global-undo-tree-mode))
#+end_src

** Skewer

Add skewer mode for a live server

#+begin_src emacs-lisp
  (use-package skewer-mode :ensure t)
  (use-package skewer-reload-stylesheets :ensure t)
#+end_src

** Smart compile

#+begin_src emacs-lisp
  (use-package smart-compile :ensure t)
#+end_src

** Prettier

#+begin_src emacs-lisp
  (use-package prettier :ensure t)
#+end_src

** Tree sitter

#+begin_src emacs-lisp
  ;; (use-package tree-sitter :ensure t)
  ;; (use-package tree-sitter-langs
  ;;   :ensure t
  ;;   :after tree-sitter)

  ;; (setq treesit-language-source-alist
  ;; 	  '((astro "https://github.com/virchau13/tree-sitter-astro")
  ;; 		(css "https://github.com/tree-sitter/tree-sitter-css")
  ;; 		(tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")))

  ;; (use-package treesit-auto
  ;;   :ensure t
  ;;   :config
  ;;   (global-treesit-auto-mode))

  ;; ;; (let ((astro-recipe (make-treesit-auto-recipe
  ;; ;; 					 :lang 'astro
  ;; ;; 					 :ts-mode 'astro-ts-mode
  ;; ;; 					 :url "https://github.com/virchau13/tree-sitter-astro"
  ;; ;; 					 :revision "master"
  ;; ;; 					 :source-dir "src")))
  ;; ;;   (add-to-list 'treesit-auto-recipe-list astro-recipe))
#+end_src

** Doom mode line

#+begin_src emacs-lisp
  ;; (use-package doom-modeline
  ;;       :ensure t
  ;;       :init (doom-modeline-mode 1))
#+end_src

** Minion

#+begin_src emacs-lisp
  ;; (use-package minions
  ;; :ensure t
  ;; :init (minions-mode))
#+end_src

** Org modern

#+begin_src emacs-lisp
  (use-package org-modern
	:ensure t
	:init (global-org-modern-mode))
#+end_src

** Org CDLaTeX

#+begin_src emacs-lisp
		(use-package cdlatex
		  :ensure t
		  :hook (org-mode-hook . turn-on-org-cdlatex))
#+end_src

** SQLPlus

#+begin_src emacs-lisp 
  ;; (require SQLplus)
  (setq sqlplus-connect-string "sys/test@//localhost:1521/xe as sysdba")
#+end_src

** Multiple cursors

#+begin_src emacs-lisp
  (use-package multiple-cursors
	:ensure t
	:bind (("C-S-c C-S-c" . mc/edit-lines)
		   ("C->" . mc/mark-next-like-this)
		   ("C-<" . mc/mark-previous-like-this)
		   ("C-c C-<" . mc/mark-all-like-this)))
#+end_src

** PlatformIO

#+begin_src emacs-lisp
  (use-package platformio-mode
	:ensure t)
#+end_src

** Org roam

#+begin_src emacs-lisp
  (use-package org-roam
	:ensure t
	:custom
	(org-roam-directory (file-truename "~/Documentos/Notas"))
	:bind (("C-c n l" . org-roam-buffer-toggle)
		   ("C-c n f" . org-roam-node-find)
		   ("C-c n g" . org-roam-graph)
		   ("C-c n i" . org-roam-node-insert)
		   ("C-c n c" . org-roam-capture)
		   ;; Dailies
		   ("C-c n j" . org-roam-dailies-capture-today))
	:config
	;; If you're using a vertical completion framework, you might want a more informative completion interface
	(setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
	(org-roam-db-autosync-mode)
	;; If using org-roam-protocol
	(require 'org-roam-protocol))
#+end_src

** Eshell syntax highlight

#+begin_src emacs-lisp
  (use-package eshell-syntax-highlighting
    :after eshell-mode
    :ensure t ;; Install if not already installed.
    :config
    ;; Enable in all Eshell buffers.
    (eshell-syntax-highlighting-global-mode +1))
#+end_src

* Language Server Protocol (LSP)
  With above setup done, below we will setup several packages closely related to LSP.

** Company
Complete anything aka Company provides auto-completion. Company-capf is enabled by default when you start LSP on a project. You can also invoke ~M-x company-capf~ to enable capf (completion at point function).
#+begin_src emacs-lisp
  (use-package company :ensure t :init (global-company-mode))
#+end_src

** Yasnippet
Yasnippet is a template system for Emacs. It allows you to type abbreviation and complete the associated text.

#+begin_src emacs-lisp
(use-package yasnippet :config (yas-global-mode))
(use-package yasnippet-snippets :ensure t)
#+end_src

E.g. In java mode, if you type ~pr~ and hit ~<TAB>~ it should complete to ~System.out.println("text");~

To create a new snippet you can use ~yas-new-snippet~ command. 

** FlyCheck
FlyCheck checks for errors in code at run-time.
#+begin_src emacs-lisp
  (use-package flycheck :ensure t :init (global-flycheck-mode))
  (setq ispell-default-dicctionary "es")
#+end_src

** Dap Mode
Emacs Debug Adapter Protocol aka DAP Mode allows us to debug your program. Below we will integrate ~dap-mode~ with ~dap-hydra~. ~Dap-hydra~ shows keys you can use to enable various options and jump through code at runtime. After we install dap-mode we will also install ~dap-java~.

#+begin_src emacs-lisp
  (use-package dap-mode
	:ensure t
	:after (lsp-mode)
	:functions dap-hydra/nil
	:config
	(require 'dap-java)
	:bind (:map lsp-mode-map
		   ("<f5>" . dap-debug)
		   ("M-<f5>" . dap-hydra))
	:hook ((dap-mode . dap-ui-mode)
	  (dap-session-created . (lambda (&_rest) (dap-hydra)))
	  (dap-terminated . (lambda (&_rest) (dap-hydra/nil)))))

  (use-package dap-java :ensure nil)
#+end_src

** Treemacs
Treemacs provides UI elements used for LSP UI. Let's install lsp-treemacs and its dependency treemacs. We will also Assign ~M-9~ to show error list.
#+begin_src emacs-lisp
  (use-package lsp-treemacs
	:after (lsp-mode treemacs)
	:ensure t
	:commands lsp-treemacs-errors-list
	:bind (:map lsp-mode-map
		   ("M-9" . lsp-treemacs-errors-list)))
  (use-package treemacs-projectile
	:ensure t
	:after (treemacs))

  (use-package treemacs-magit
	:ensure t
	:after (treemacs))

  (use-package treemacs-all-the-icons
	:ensure t
	:after (treemacs))

  (use-package treemacs
	:ensure t
	:commands (treemacs)
	:after (lsp-mode))
#+end_src

** LSP UI
LSP UI is used in various packages that require UI elements in LSP. E.g. ~lsp-ui-flycheck-list~ opens a windows where you can see various coding errors while you code. You can use ~C-c l T~ to toggle several UI elements. We have also remapped some of the xref-find functions, so that we can easily jump around between symbols using ~M-.~, ~M-,~ and ~M-?~ keys.

#+begin_src emacs-lisp
(use-package lsp-ui
:ensure t
:after (lsp-mode)
:bind (:map lsp-ui-mode-map
         ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
         ([remap xref-find-references] . lsp-ui-peek-find-references))
:init (setq lsp-ui-doc-delay 1.5
      lsp-ui-doc-position 'bottom
	  lsp-ui-doc-max-width 100
))
#+end_src

Go through this [[https://github.com/emacs-lsp/lsp-ui/blob/master/lsp-ui-doc.el][link]]  to see what other parameters are provided.

** Helm LSP
Helm-lsp provides various functionality to work with the code. E.g. Code actions like adding *getter, setter, toString*, refactoring etc. You can use ~helm-lsp-workspace-symbol~ to find various symbols (classes) within your workspace.

LSP's built in symbol explorer uses ~xref-find-apropos~ to provide symbol navigation. Below we will replace that with helm version. After that you can use ~C-c l g a~ to find workspace symbols in a more intuitive way.

#+begin_src emacs-lisp
(use-package helm-lsp
:ensure t
:after (lsp-mode)
:commands (helm-lsp-workspace-symbol)
:init (define-key lsp-mode-map [remap xref-find-apropos] #'helm-lsp-workspace-symbol))
#+end_src

** Install LSP Package
Let's install the main package for lsp. Here we will integrate lsp with which-key. This way, when we type the prefix key ~C-c l~ we get additional help for completing the command. 

#+begin_src emacs-lisp
  (use-package lsp-mode
  :ensure t
  :hook (
	 (lsp-mode . lsp-enable-which-key-integration)
	 (java-mode . #'lsp-deferred)
	 (latex-mode . #'lsp-deferred)
	 (gdscript-mode . #'lsp-deferred)
	 (css-mode . #'lsp-deferred)
  )
  :init (setq 
	  lsp-keymap-prefix "C-c l"              ; this is for which-key integration documentation, need to use lsp-mode-map
	  lsp-enable-file-watchers nil
	  read-process-output-max (* 1024 1024)  ; 1 mb
	  lsp-completion-provider :capf
	  lsp-idle-delay 0.500
  )
  :config 
	  (setq lsp-intelephense-multi-root nil) ; don't scan unnecessary projects
	  (with-eval-after-load 'lsp-intelephense
	  (setf (lsp--client-multi-root (gethash 'iph lsp-clients)) nil))
	  (define-key lsp-mode-map (kbd "C-c l") lsp-command-map)
  )
#+end_src

You can start LSP server in a java project by using ~C-c l s s~. Once you type ~C-c l~ ~which-key~ package should guide you through rest of the options. In above setting I have added some memory management settings as suggested in [[https://emacs-lsp.github.io/lsp-mode/page/performance/][this guide]]. Change them to higher numbers, if you find *lsp-mode* sluggish in your computer.

