emacs-configuration.el

;; (use-package emms
;;   :config
;;   (require 'emms-player-mpd)
;;   (require 'emms-mpris)
;;   (emms-all)
;;   (setq emms-player-list emms-player-mpd)
;;   (setq emms-info-functions 'emms-info-mpd)
;;   (setq emms-change-volume-function 'emms-volume-mpd-change)
;;   (fset emms-browser-covers 'emms-browser-cache-thumbnail)
;;   (add-to-list 'emms-player-list 'emms-player-mpd))

;; (emms-all)
;; (emms-default-players)
;; (emms-mode-line 1)

;; (use-package emms-browser
;;   :config
;;   (setq emms-browser-covers 'emms-browser-cache-thumbnail)
;;   (setq emms-browser-covers-for-first-column 'emms-browser-cache-thumbnail))

;; (use-package emms-player-mpd
;;   :config
;;   (setq emms-player-list '(emms-player-mpd))
;;   (setq emms-info-functions '(emms-info-mpd))
;;   (setq emms-change-volume-function 'emms-volume-mpd-change)
;;   (add-to-list 'emms-player-list 'emms-player-mpd))

(use-package elcord :ensure t)
(elcord-mode)

;; (when (s-contains? "NixOS" (which-linux-distribution)) (fset 'bitlbee-command-line
;; 							     (lambda ()
;; 							   ((concat bitlbee-executable " " bitlbee-options " -d " bitlbee-user-directory)))))
;; (use-package bitlbee :ensure t)

(use-package undo-tree :ensure t :init (global-undo-tree-mode))

(use-package skewer-mode :ensure t)
(use-package skewer-reload-stylesheets :ensure t)

(use-package smart-compile :ensure t)

(use-package prettier :ensure t)

;; (use-package tree-sitter :ensure t)
;; (use-package tree-sitter-langs
;;   :ensure t
;;   :after tree-sitter)

;; (setq treesit-language-source-alist
;; 	  '((astro "https://github.com/virchau13/tree-sitter-astro")
;; 		(css "https://github.com/tree-sitter/tree-sitter-css")
;; 		(tsx "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")))

;; (use-package treesit-auto
;;   :ensure t
;;   :config
;;   (global-treesit-auto-mode))

;; ;; (let ((astro-recipe (make-treesit-auto-recipe
;; ;; 					 :lang 'astro
;; ;; 					 :ts-mode 'astro-ts-mode
;; ;; 					 :url "https://github.com/virchau13/tree-sitter-astro"
;; ;; 					 :revision "master"
;; ;; 					 :source-dir "src")))
;; ;;   (add-to-list 'treesit-auto-recipe-list astro-recipe))

;; (use-package doom-modeline
;;       :ensure t
;;       :init (doom-modeline-mode 1))

;; (use-package minions
;; :ensure t
;; :init (minions-mode))

(use-package org-modern
	:ensure t
	:init (global-org-modern-mode))

(use-package cdlatex
  :ensure t
  :hook (org-mode-hook . turn-on-org-cdlatex))

;; (require SQLplus)
(setq sqlplus-connect-string "sys/test@//localhost:1521/xe as sysdba")

(use-package multiple-cursors
	:ensure t
	:bind (("C-S-c C-S-c" . mc/edit-lines)
		   ("C->" . mc/mark-next-like-this)
		   ("C-<" . mc/mark-previous-like-this)
		   ("C-c C-<" . mc/mark-all-like-this)))

(use-package platformio-mode
	:ensure t)

(use-package org-roam
	:ensure t
	:custom
	(org-roam-directory (file-truename "~/Documentos/Notas"))
	:bind (("C-c n l" . org-roam-buffer-toggle)
		   ("C-c n f" . org-roam-node-find)
		   ("C-c n g" . org-roam-graph)
		   ("C-c n i" . org-roam-node-insert)
		   ("C-c n c" . org-roam-capture)
		   ;; Dailies
		   ("C-c n j" . org-roam-dailies-capture-today))
	:config
	;; If you're using a vertical completion framework, you might want a more informative completion interface
	(setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
	(org-roam-db-autosync-mode)
	;; If using org-roam-protocol
	(require 'org-roam-protocol))

(use-package company :ensure t :init (global-company-mode))

(use-package yasnippet :config (yas-global-mode))
(use-package yasnippet-snippets :ensure t)

(use-package flycheck :ensure t :init (global-flycheck-mode))
(setq ispell-default-dicctionary "es")

(use-package dap-mode
	:ensure t
	:after (lsp-mode)
	:functions dap-hydra/nil
	:config
	(require 'dap-java)
	:bind (:map lsp-mode-map
		   ("<f5>" . dap-debug)
		   ("M-<f5>" . dap-hydra))
	:hook ((dap-mode . dap-ui-mode)
	  (dap-session-created . (lambda (&_rest) (dap-hydra)))
	  (dap-terminated . (lambda (&_rest) (dap-hydra/nil)))))

(use-package dap-java :ensure nil)

(use-package lsp-treemacs
	:after (lsp-mode treemacs)
	:ensure t
	:commands lsp-treemacs-errors-list
	:bind (:map lsp-mode-map
		   ("M-9" . lsp-treemacs-errors-list)))
(use-package treemacs-projectile
	:ensure t
	:after (treemacs))

(use-package treemacs-magit
	:ensure t
	:after (treemacs))

(use-package treemacs-all-the-icons
	:ensure t
	:after (treemacs))

(use-package treemacs
	:ensure t
	:commands (treemacs)
	:after (lsp-mode))

(use-package lsp-ui
:ensure t
:after (lsp-mode)
:bind (:map lsp-ui-mode-map
         ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
         ([remap xref-find-references] . lsp-ui-peek-find-references))
:init (setq lsp-ui-doc-delay 1.5
      lsp-ui-doc-position 'bottom
	  lsp-ui-doc-max-width 100
))

(use-package helm-lsp
:ensure t
:after (lsp-mode)
:commands (helm-lsp-workspace-symbol)
:init (define-key lsp-mode-map [remap xref-find-apropos] #'helm-lsp-workspace-symbol))

(use-package lsp-mode
:ensure t
:hook (
	 (lsp-mode . lsp-enable-which-key-integration)
	 (java-mode . #'lsp-deferred)
	 (latex-mode . #'lsp-deferred)
	 (gdscript-mode . #'lsp-deferred)
	 (css-mode . #'lsp-deferred)
)
:init (setq 
	  lsp-keymap-prefix "C-c l"              ; this is for which-key integration documentation, need to use lsp-mode-map
	  lsp-enable-file-watchers nil
	  read-process-output-max (* 1024 1024)  ; 1 mb
	  lsp-completion-provider :capf
	  lsp-idle-delay 0.500
)
:config 
	  (setq lsp-intelephense-multi-root nil) ; don't scan unnecessary projects
	  (with-eval-after-load 'lsp-intelephense
	  (setf (lsp--client-multi-root (gethash 'iph lsp-clients)) nil))
	  (define-key lsp-mode-map (kbd "C-c l") lsp-command-map)
)
