emacs-configuration.el

(setq dap-auto-configure-features '(sessions locals controls tooltip))

(use-package lsp-java 
:ensure t
:config (add-hook 'java-mode-hook 'lsp))
(setq lsp-java-workspace-dir "/home/ivvil/Documentos/Eclipse")
(require 'dap-java)

(add-hook 'html-mode-hook 'lsp)

(use-package svelte-mode :ensure t)

;; (use-package astro-ts-mode :ensure t)

(add-hook 'js-mode-hook 'lsp)

(require 'ob-js)

(add-to-list 'org-babel-load-languages '(js . t))
(org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
(add-to-list 'org-babel-tangle-lang-exts '("js" . "js"))

(use-package jsdoc
	:ensure t)

(use-package ob-typescript
	:ensure t)

(org-babel-do-load-languages
 'org-babel-load-languages
 '((typescript . t)
	 ))

(setq org-babel-command:typescript "npx -p typescript -- tsc")

(use-package json-mode :ensure t)

(add-hook 'scss-mode-hook
			(lambda () ((skewer-reload-stylesheets-reload-on-save)(skewer-reload-stylesheets-start-editing))))

(use-package sly :ensure t)
(setq inferior-lisp-program "sbcl")
(add-hook 'common-lisp-hook 'company-mode)

(use-package geiser-guile :ensure t)
(use-package ac-geiser :ensure t)

(use-package auctex :ensure t :hook (latex-mode . acutex-mode))
(use-package company-auctex :ensure t)
(use-package auto-complete-auctex :ensure t)
(setq-default TeX-engine 'xetex)

(use-package markless
	:ensure t)

(use-package nix-mode :ensure t)
(setf lsp-nix-nil-formatter ["alejandra"])

(use-package rust-mode :ensure t :hook ((rust-mode . cargo-minor-mode)
										  (rust-mode . lsp)))
(use-package flycheck-rust
	:ensure t)
(with-eval-after-load 'rust-mode
	(add-hook 'flycheck-mode-hook #'flycheck-rust-setup))

(use-package gdscript-mode :ensure t)

(use-package ccls
	:ensure t)
(setq ccls-executable "/run/current-system/sw/bin/ccls")

(require 'dap-lldb)
(require 'dap-cpptools)
(require 'dap-gdb-lldb)

(add-hook 'csharp-mode-hook 'lsp)

;;  ;;;; Code Completion

;; (use-package corfu
;;   ;; Optional customizations
;;   :custom
;;   (corfu-cycle t)                 ; Allows cycling through candidates
;;   (corfu-auto t)                  ; Enable auto completion
;;   (corfu-auto-prefix 2)
;;   (corfu-auto-delay 0.3)
;;   (corfu-popupinfo-delay '(0.5 . 0.2))
;;   (corfu-preview-current 'insert) ; insert previewed candidate
;;   (corfu-preselect 'prompt)
;;   (corfu-on-exact-match nil)      ; Don't auto expand tempel snippets

;;   ;; Optionally use TAB for cycling, default is `corfu-complete'.
;;   :bind (:map corfu-map
;; 			  ("M-SPC"      . corfu-insert-separator)
;; 			  ("TAB"        . corfu-next)
;; 			  ([tab]        . corfu-next)
;; 			  ("S-TAB"      . corfu-previous)
;; 			  ([backtab]    . corfu-previous)
;; 			  ("S-<return>" . corfu-insert)
;; 			  ("RET"        . nil))

;;   :init
;;   (global-corfu-mode)
;;   (corfu-history-mode)
;;   (corfu-popupinfo-mode) ; Popup completion info
;;   :config
;;   (add-hook 'eshell-mode-hook
;; 			(lambda () (setq-local corfu-quit-at-boundary t
;; 								   corfu-quit-no-match t
;; 								   corfu-auto nil)
;; 			  (corfu-mode))))

;; (use-package eaf
;;   :load-path "~/.emacs.d/site-lisp/emacs-application-framework"
;;   :custom
;; 										; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
;;   (eaf-browser-continue-where-left-off t)
;;   (eaf-browser-enable-adblocker t)
;;   (browse-url-browser-function 'eaf-open-browser)
;;   :config
;;   (defalias 'browse-web #'eaf-open-browser)
;;   (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
;;   (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
;;   (eaf-bind-key take_photo "p" eaf-camera-keybinding)
;;   (eaf-bind-key nil "M-q" eaf-browser-keybinding)) ;; unbind, see more in the Wiki

;; (require 'eaf-browser)
;; (require 'eaf-pdf-viewer)
;; (require 'eaf-music-player)
;; (require 'eaf-video-player)
;; (require 'eaf-js-video-player)
;; (require 'eaf-image-viewer)
;; (require 'eaf-rss-reader)
;; (require 'eaf-terminal)
;; (require 'eaf-markdown-previewer)
;; (require 'eaf-org-previewer)
;; (require 'eaf-camera)
;; (require 'eaf-git)
;; (require 'eaf-file-manager)
;; (require 'eaf-mindmap)
;; (require 'eaf-netease-cloud-music)
;; (require 'eaf-system-monitor)
;; (require 'eaf-file-browser)
;; (require 'eaf-file-sender)
;; (require 'eaf-airshare)
;; (require 'eaf-jupyter)
;; (require 'eaf-2048)
;; (require 'eaf-markmap)
;; (require 'eaf-map)
;; (require 'eaf-demo)
;; (require 'eaf-vue-demo)
;; (require 'eaf-vue-tailwindcss)
;; (require 'eaf-pyqterminal)
